test/stress_test/stress_test.yaml
config:
  target: 'https://v7m75ji4el.execute-api.eu-central-1.amazonaws.com/dev'
  phases:
    - duration: 10
      arrivalRate: 1
      name: Warm up phase
    - duration: 300
      arrivalRate: 6
      name: Load phase
  # Comment out if directly setting the body
  processor: "./sample_test_case.js"
  defaults:
    headers:
      Authorization: 'Bearer <INSERT COGNITO USER JWT TOKEN'
scenarios:
  - flow:
      # Comment out if directly setting the body
    - function: "getSample"
    - post:
        url: "/inference"
        # Or add a Base64 encoded test image directly below
        body: {{b64string}}